kaleaakash96/SmartCar_esp32/src/main.cpp
// ///////////////////////////////////////////////////////////////////////////////////////////////              
// base code
// #include <ESP32Servo.h> // Use ESP32Servo for better timer management on ESP32
// #include <Wire.h>
// #include "Adafruit_VL6180X.h"

// #include <AnimatedGIF.h>
// #include <SPI.h>
// #include <TFT_eSPI.h>

// //#include "out.h"
// #include "sideview.h"
// #include "sleep.h"

// //#define GIF_IMAGE_1 sideview
// //#define GIF_IMAGE_2 sleepy
// //#define GIF_IMAGE_3 spongebob

// #define DISPLAY_WIDTH  tft.width()
// #define DISPLAY_HEIGHT tft.height()
// #define BUFFER_SIZE 256            // Optimum is >= GIF width or integral division of width

// #define M1  26    
// #define M2  27
// #define M3  14
// #define M4  12

// #define enb1  25
// #define enb2  33

// #define sensorLIP 35
// #define sensorRIP 32

// TFT_eSPI tft = TFT_eSPI();
// AnimatedGIF gif;
// Adafruit_VL6180X vl = Adafruit_VL6180X();
// Servo myservo;

// // Structure to hold GIF data + size
// struct GifItem {
//   const uint8_t* data;
//   size_t size;
// };

// // Add all GIFs here
// GifItem gifs[] = {
//   {sideview, sizeof(sideview)},
//   {sleepy, sizeof(sleepy)}
// };

// int gifCount = sizeof(gifs) / sizeof(gifs[0]);
// //const uint8_t* GIF_IMAGE_1 = sideview;   //  No DMA  63 fps, DMA:  71fps
// //const uint8_t* GIF_IMAGE_2 = sleepy;
// //const uint8_t* GIF_IMAGE_3 = sleepy;

// #ifdef USE_DMA
//   uint16_t usTemp[2][BUFFER_SIZE]; // Global to support DMA use
// #else
//   uint16_t usTemp[1][BUFFER_SIZE];    // Global to support DMA use
// #endif
// bool     dmaBuf = 0;

// uint8_t ref = 100;
// int servoPin = 16; // Valid PWM GPIO pin (e.g., 18)
// int pos = 0;
// ////////////////////////////////////////////////////////////////////////
// // Draw a line of image directly on the LCD
// void GIFDraw(GIFDRAW *pDraw)
// {
//   uint8_t *s;
//   uint16_t *d, *usPalette;
//   int x, y, iWidth, iCount;

//   // Displ;ay bounds chech and cropping
//   iWidth = pDraw->iWidth;
//   if (iWidth + pDraw->iX > DISPLAY_WIDTH)
//     iWidth = DISPLAY_WIDTH - pDraw->iX;
//   usPalette = pDraw->pPalette;
//   y = pDraw->iY + pDraw->y; // current line
//   if (y >= DISPLAY_HEIGHT || pDraw->iX >= DISPLAY_WIDTH || iWidth < 1)
//     return;

//   // Old image disposal
//   s = pDraw->pPixels;
//   if (pDraw->ucDisposalMethod == 2) // restore to background color
//   {
//     for (x = 0; x < iWidth; x++)
//     {
//       if (s[x] == pDraw->ucTransparent)
//         s[x] = pDraw->ucBackground;
//     }
//     pDraw->ucHasTransparency = 0;
//   }

//   // Apply the new pixels to the main image
//   if (pDraw->ucHasTransparency) // if transparency used
//   {
//     uint8_t *pEnd, c, ucTransparent = pDraw->ucTransparent;
//     pEnd = s + iWidth;
//     x = 0;
//     iCount = 0; // count non-transparent pixels
//     while (x < iWidth)
//     {
//       c = ucTransparent - 1;
//       d = &usTemp[0][0];
//       while (c != ucTransparent && s < pEnd && iCount < BUFFER_SIZE )
//       {
//         c = *s++;
//         if (c == ucTransparent) // done, stop
//         {
//           s--; // back up to treat it like transparent
//         }
//         else // opaque
//         {
//           *d++ = usPalette[c];
//           iCount++;
//         }
//       } // while looking for opaque pixels
//       if (iCount) // any opaque pixels?
//       {
//         // DMA would degrtade performance here due to short line segments
//         tft.setAddrWindow(pDraw->iX + x, y, iCount, 1);
//         tft.pushPixels(usTemp, iCount);
//         x += iCount;
//         iCount = 0;
//       }
//       // no, look for a run of transparent pixels
//       c = ucTransparent;
//       while (c == ucTransparent && s < pEnd)
//       {
//         c = *s++;
//         if (c == ucTransparent)
//           x++;
//         else
//           s--;
//       }
//     }
//   }
//   else
//   {
//     s = pDraw->pPixels;

//     // Unroll the first pass to boost DMA performance
//     // Translate the 8-bit pixels through the RGB565 palette (already byte reversed)
//     if (iWidth <= BUFFER_SIZE)
//       for (iCount = 0; iCount < iWidth; iCount++) usTemp[dmaBuf][iCount] = usPalette[*s++];
//     else
//       for (iCount = 0; iCount < BUFFER_SIZE; iCount++) usTemp[dmaBuf][iCount] = usPalette[*s++];

// #ifdef USE_DMA // 71.6 fps (ST7796 84.5 fps)
//     tft.dmaWait();
//     tft.setAddrWindow(pDraw->iX, y, iWidth, 1);
//     tft.pushPixelsDMA(&usTemp[dmaBuf][0], iCount);
//     dmaBuf = !dmaBuf;
// #else // 57.0 fps
//     tft.setAddrWindow(pDraw->iX, y, iWidth, 1);
//     tft.pushPixels(&usTemp[0][0], iCount);
// #endif

//     iWidth -= iCount;
//     // Loop if pixel buffer smaller than width
//     while (iWidth > 0)
//     {
//       // Translate the 8-bit pixels through the RGB565 palette (already byte reversed)
//       if (iWidth <= BUFFER_SIZE)
//         for (iCount = 0; iCount < iWidth; iCount++) usTemp[dmaBuf][iCount] = usPalette[*s++];
//       else
//         for (iCount = 0; iCount < BUFFER_SIZE; iCount++) usTemp[dmaBuf][iCount] = usPalette[*s++];

// #ifdef USE_DMA
//       tft.dmaWait();
//       tft.pushPixelsDMA(&usTemp[dmaBuf][0], iCount);
//       dmaBuf = !dmaBuf;
// #else
//       tft.pushPixels(&usTemp[0][0], iCount);
// #endif
//       iWidth -= iCount;
//     }
//   }
// } /* GIFDraw() */

// void gifPlayer(const uint8_t* data, size_t size){
//    int frames = 0;
//   long startTime = micros();

//   if (gif.open((uint8_t*)data, size, GIFDraw))
//   {
//     tft.startWrite();

//     while (gif.playFrame(false, NULL))
//     {
//       frames++;
//       delay(50);
//       yield();  // keep ESP32 stable
//     }

//     gif.close();
//     tft.endWrite();

//     long duration = micros() - startTime;

//     Serial.print("FPS: ");
//     Serial.println(frames / (duration / 1000000.0));
//   }
//  }

//  void gif_loop(){
  
//  for (int i = 0; i < gifCount; i++)
//   {
//     gifPlayer(gifs[i].data, gifs[i].size);
//     delay(200); // small gap between GIFs
//   }
  
// }

// void trunck(){
//   uint8_t range = vl.readRange();
//   uint8_t status = vl.readRangeStatus();  

//     if (status == VL6180X_ERROR_NONE) {
//     Serial.print("Range: "); Serial.println(range);
//   }

//   if((range > ref%2) && (range <= ref)) { // open trank for 5 sec at 100 degree
//     myservo.write(100);
//     delay(5000);
//      myservo.write(0);
//   }
// }

// void forward(){
//   digitalWrite(M1,HIGH);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,HIGH);
//   digitalWrite(M4,LOW); 
// }

