kaleaakash96/SmartCar_esp32/src/main.cpp
// void left(){
//   digitalWrite(M1,LOW);
//   digitalWrite(M2,HIGH);
//   digitalWrite(M3,HIGH);
//   digitalWrite(M4,LOW); 
// }

// void right(){
//   digitalWrite(M1,HIGH);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,LOW);
//   digitalWrite(M4,HIGH); 
// }

// void backward(){
//   digitalWrite(M1,LOW);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,LOW);
//   digitalWrite(M4,LOW); 
// }

// void car_motion(){

//   int sensorL = digitalRead(sensorLIP);
//   int sensorR = digitalRead(sensorRIP);

//   digitalWrite(enb1,HIGH);
//   digitalWrite(enb2,HIGH);
  
//   if(sensorL == 0 && sensorR == 0){
//     Serial.println("F");
//     forward();
//     return ;
//   }
//    else if(sensorL == 0 && sensorR == 1){
//     left();
//     return ;
//   }
//     else if(sensorL == 1 && sensorR == 0){
//       right();
//     return ;
//   }
//     else if(sensorL == 1 && sensorR == 1){
//       backward(); 
//     return ;
//   }
//   else{
//   }
// }


// // void Task1(void *pvParameters) {
// //     while (true) {
// //         Serial.println("Task 1 car");
// //           car_motion();
// //           trunck();
  
// //         // vTaskDelay(1000 / portTICK_PERIOD_MS);
// //     }
// // }

// // void Task2(void *pvParameters) {
// //     while (true) {
// //         Serial.println("Task 2 gif");
// //         gif_loop();
// //         // vTaskDelay(500 / portTICK_PERIOD_MS);
// //     }
// // }

// void setup() {
//   Serial.begin(115200);
//   pinMode(enb1,OUTPUT);
//   pinMode(enb2,OUTPUT);
  
//   pinMode(M1,OUTPUT);
//   pinMode(M2,OUTPUT);
//   pinMode(M3,OUTPUT);
//   pinMode(M4,OUTPUT);

//   pinMode(sensorLIP,INPUT);
//   pinMode(sensorRIP,INPUT);

//   myservo.attach(servoPin);
//   if (! vl.begin()) {
//     Serial.println("Failed to find sensor");
//     while (1);
//   }
//   myservo.write(0);

//   tft.begin();
// #ifdef USE_DMA
//   tft.initDMA();
// #endif
//   tft.setRotation(1);
//   tft.fillScreen(TFT_BLACK);

//   tft.fillScreen(TFT_RED);
//   delay(2000);
//   tft.fillScreen(TFT_GREEN);
//   delay(2000);
//   tft.fillScreen(TFT_BLUE);
//   delay(2000);
//   gif.begin(BIG_ENDIAN_PIXELS);

//   // xTaskCreate(
//   //       Task1,        // function
//   //       "Task1",      // name
//   //       2048,         // stack size
//   //       NULL,
//   //       1,            // priority
//   //       NULL
//   //   );

//   //   xTaskCreate(
//   //       Task2,
//   //       "Task2",
//   //       2048,
//   //       NULL,
//   //       1,
//   //       NULL
//   //   );

// }

// void loop() {

//   car_motion();
//   trunck();
//   gif_loop();
  
// }

// ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// // multitasking working without BLE
// #include <ESP32Servo.h>
// #include <Wire.h>
// #include "Adafruit_VL6180X.h"

// #include <AnimatedGIF.h>
// #include <SPI.h>
// #include <TFT_eSPI.h>

// #include "sideview.h"
// #include "sleep.h"

// // ------------------- PINS -------------------
// #define M1  26    
// #define M2  27
// #define M3  14
// #define M4  12

// #define enb1  25
// #define enb2  33

// #define sensorLIP 35
// #define sensorRIP 32

// // ------------------- OBJECTS -------------------
// TFT_eSPI tft = TFT_eSPI();
// AnimatedGIF gif;
// Adafruit_VL6180X vl = Adafruit_VL6180X();
// Servo myservo;

// // ------------------- GIF STRUCT -------------------
// struct GifItem {
//   const uint8_t* data;
//   size_t size;
// };

// GifItem gifs[] = {
//   {sideview, sizeof(sideview)},
//   {sleepy, sizeof(sleepy)}
// };

// int gifCount = sizeof(gifs) / sizeof(gifs[0]);

// #define BUFFER_SIZE 256
// uint16_t usTemp[1][BUFFER_SIZE];

// uint8_t ref = 100;
// int servoPin = 16;

// // ------------------- GIF DRAW -------------------
// void GIFDraw(GIFDRAW *pDraw)
// {
//   uint8_t *s = pDraw->pPixels;
//   uint16_t *d = usTemp[0];
//   uint16_t *palette = pDraw->pPalette;

//   int x = pDraw->iX;
//   int y = pDraw->iY + pDraw->y;
//   int width = pDraw->iWidth;

//   if (y >= tft.height()) return;

//   for (int i = 0; i < width; i++) {
//     d[i] = palette[*s++];
//   }

//   tft.setAddrWindow(x, y, width, 1);
//   tft.pushPixels(d, width);
// }

// // ------------------- GIF PLAYER -------------------
// void gifPlayer(const uint8_t* data, size_t size)
// {
//   if (gif.open((uint8_t*)data, size, GIFDraw))
//   {
//     tft.startWrite();

//     while (gif.playFrame(false, NULL))
//     {
//       delay(30);   // SAFE here (loop context)
//       yield();
//     }

//     gif.close();
//     tft.endWrite();
//   }
// }

// void gif_loop()
// {
//   for (int i = 0; i < gifCount; i++)
//   {
//     gifPlayer(gifs[i].data, gifs[i].size);
//     delay(200);
//   }
// }

// // ------------------- SERVO NON-BLOCKING -------------------
// void trunck()
// {
//   static bool open = false;
//   static unsigned long startTime = 0;

//   uint8_t range = vl.readRange();
//   uint8_t status = vl.readRangeStatus();

//   if ((range > 2) && (range <= ref) && !open) {
//     myservo.write(100);
//     startTime = millis();
//     open = true;
//   }

//   if (open && (millis() - startTime > 5000)) {
//     myservo.write(0);
//     open = false;
//   }
// }

// // ------------------- MOTOR CONTROL -------------------
// void forward(){
//   digitalWrite(M1,HIGH);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,HIGH);
//   digitalWrite(M4,LOW); 
// }

// void left(){
//   digitalWrite(M1,LOW);
//   digitalWrite(M2,HIGH);
//   digitalWrite(M3,HIGH);
//   digitalWrite(M4,LOW); 
// }

// void right(){
//   digitalWrite(M1,HIGH);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,LOW);
//   digitalWrite(M4,HIGH); 
// }

// void backward(){
//   digitalWrite(M1,LOW);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,LOW);
//   digitalWrite(M4,LOW); 
// }

// void car_motion()
// {
//   int sensorL = digitalRead(sensorLIP);
//   int sensorR = digitalRead(sensorRIP);

//   digitalWrite(enb1,HIGH);
//   digitalWrite(enb2,HIGH);

