kaleaakash96/SmartCar_esp32/src/main.cpp
//   if(sensorL == 0 && sensorR == 0){
//     forward();
//   }
//   else if(sensorL == 0 && sensorR == 1){
//     left();
//   }
//   else if(sensorL == 1 && sensorR == 0){
//     right();
//   }
//   else{
//     backward();
//   }
// }

// // ------------------- RTOS TASK (CAR ONLY) -------------------
// void TaskCar(void *pvParameters)
// {
//   while (true)
//   {
//     car_motion();
//     trunck();

//     vTaskDelay(50 / portTICK_PERIOD_MS); // IMPORTANT
//   }
// }

// // ------------------- SETUP -------------------
// void setup()
// {
//   Serial.begin(115200);

//   pinMode(enb1,OUTPUT);
//   pinMode(enb2,OUTPUT);

//   pinMode(M1,OUTPUT);
//   pinMode(M2,OUTPUT);
//   pinMode(M3,OUTPUT);
//   pinMode(M4,OUTPUT);

//   pinMode(sensorLIP,INPUT);
//   pinMode(sensorRIP,INPUT);

//   myservo.attach(servoPin);

//   if (!vl.begin()) {
//     Serial.println("Sensor fail");
//     while (1);
//   }

//   myservo.write(0);

//   tft.begin();
//   tft.setRotation(1);
//   tft.fillScreen(TFT_BLACK);

//   gif.begin(BIG_ENDIAN_PIXELS);

//   // ONLY CAR TASK (RTOS SAFE)
//   xTaskCreatePinnedToCore(
//     TaskCar,
//     "CarTask",
//     2048,
//     NULL,
//     2,
//     NULL,
//     0   // Core 0
//   );
// }

// // ------------------- LOOP (DISPLAY SAFE ZONE) -------------------
// void loop()
// {
//   // gif_loop();   // DISPLAY RUNS HERE (NO RTOS ISSUES)

//    gifPlayer(gifs[0].data, gifs[0].size);


// }


// /////////////////////////////////////////////////////////////////////////////////////////

// multitasking code
// #include <ESP32Servo.h>
// #include <Wire.h>
// #include "Adafruit_VL6180X.h"

// #include <AnimatedGIF.h>
// #include <SPI.h>
// #include <TFT_eSPI.h>

// #include "sideview.h"
// #include "sleep.h"

// // ---------------- BLE ----------------
// #include <BLEDevice.h>
// #include <BLEServer.h>
// #include <BLEUtils.h>
// #include <BLE2902.h>

// BLECharacteristic *pCharacteristic;

// #define SERVICE_UUID        "12345678-1234-1234-1234-123456789abc"
// #define CHARACTERISTIC_UUID "abcd1234-5678-1234-5678-abcdef123456"

// // ---------------- PINS ----------------
// #define M1  26    
// #define M2  27
// #define M3  14
// #define M4  12

// #define enb1  25
// #define enb2  33

// #define sensorLIP 35
// #define sensorRIP 32

// // ---------------- OBJECTS ----------------
// TFT_eSPI tft = TFT_eSPI();
// AnimatedGIF gif;
// Adafruit_VL6180X vl = Adafruit_VL6180X();
// Servo myservo;

// // ---------------- GIF DATA ----------------
// struct GifItem {
//   const uint8_t* data;
//   size_t size;
// };

// GifItem gifs[] = {
//   {sideview, sizeof(sideview)},
//   {sleepy, sizeof(sleepy)}
// };

// int gifCount = sizeof(gifs) / sizeof(gifs[0]);

// #define BUFFER_SIZE 256
// uint16_t usTemp[1][BUFFER_SIZE];

// uint8_t ref = 100;
// int servoPin = 16;

// // ---------------- CONTROL FLAGS ----------------
// bool manualMode = false;
// char lastCommand = 'S';

// // ---------------- MOTOR CONTROL ----------------
// void forward(){
//   digitalWrite(M1,HIGH);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,HIGH);
//   digitalWrite(M4,LOW); 
// }

// void left(){
//   digitalWrite(M1,LOW);
//   digitalWrite(M2,HIGH);
//   digitalWrite(M3,HIGH);
//   digitalWrite(M4,LOW); 
// }

// void right(){
//   digitalWrite(M1,HIGH);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,LOW);
//   digitalWrite(M4,HIGH); 
// }

// void backward(){
//   digitalWrite(M1,LOW);
//   digitalWrite(M2,LOW);
//   digitalWrite(M3,LOW);
//   digitalWrite(M4,LOW); 
// }

// // ---------------- SENSOR LOGIC ----------------
// void car_motion()
// {
//   if (manualMode) return; // skip auto mode

//   int sensorL = digitalRead(sensorLIP);
//   int sensorR = digitalRead(sensorRIP);

//   digitalWrite(enb1,HIGH);
//   digitalWrite(enb2,HIGH);

//   if(sensorL == 0 && sensorR == 0){
//     forward();
//   }
//   else if(sensorL == 0 && sensorR == 1){
//     left();
//   }
//   else if(sensorL == 1 && sensorR == 0){
//     right();
//   }
//   else{
//     backward();
//   }
// }

// // ---------------- TRUNK (NON BLOCKING) ----------------
// void trunck()
// {
//   static bool open = false;
//   static unsigned long startTime = 0;

//   uint8_t range = vl.readRange();

//   if ((range > 2) && (range <= ref) && !open) {
//     myservo.write(100);
//     startTime = millis();
//     open = true;
//   }

//   if (open && (millis() - startTime > 5000)) {
//     myservo.write(0);
//     open = false;
//   }
// }

// // ---------------- GIF PLAYER ----------------
// void GIFDraw(GIFDRAW *pDraw)
// {
//   uint8_t *s = pDraw->pPixels;
//   uint16_t *d = usTemp[0];
//   uint16_t *palette = pDraw->pPalette;

//   int x = pDraw->iX;
//   int y = pDraw->iY + pDraw->y;
//   int width = pDraw->iWidth;

//   if (y >= tft.height()) return;

//   for (int i = 0; i < width; i++) {
//     d[i] = palette[*s++];
//   }

//   tft.setAddrWindow(x, y, width, 1);
//   tft.pushPixels(d, width);
// }

// void gifPlayer(const uint8_t* data, size_t size)
// {
//   if (gif.open((uint8_t*)data, size, GIFDraw))
//   {
//     tft.startWrite();

//     while (gif.playFrame(false, NULL))
//     {
//       delay(50);
//       yield();
//     }

//     gif.close();
//     tft.endWrite();
//   }
// }

// bool Mstatus = false;
// // ---------------- BLE CALLBACK ----------------
// class MyCallbacks: public BLECharacteristicCallbacks {
//   void onWrite(BLECharacteristic *pCharacteristic) {
//     std::string value = pCharacteristic->getValue();

//     if (value.length() > 0) {
//       String cmd = String(value.c_str());
//       Serial.println("BLE: " + cmd);

//       if (cmd == "F"){
//         forward();
//         delay(100);
//         backward();
//       }else if (cmd == "L")
//       {
//         left();
//         delay(100);
//         backward();
//         /* code */
//       }else if (cmd == "R")
//       {
//         right();
//         delay(100);
//         backward();
//         /* code */
//       }else if (cmd == "S")
//       {
//         backward();
//         delay(100);
//         backward();
//         /* code */
//       }else if (cmd == "T")
//       {
//         myservo.write(100);
//         delay(5000);
//         myservo.write(0);
//       }else if (cmd == "P") // p = start motor data enable motor
//       {
//         Mstatus = true;
//       }else if (cmd == "O") // O = stop motor or disable motor
//       {
//         Mstatus = false;
//       }
      

//       // manualMode = true;

//       // if (cmd == "F") forward();
//       // else if (cmd == "L") left();
//       // else if (cmd == "R") right();
//       // else if (cmd == "B") backward();
//       // else if (cmd == "S") {
//       //   manualMode = false;
//       // }
//       // else if (cmd == "T") trunck();
//     }
//   }
// };

// // ---------------- BLE INIT ----------------
// void initBLE()
// {
//   BLEDevice::init("ESP32-Robot");

//   BLEServer *server = BLEDevice::createServer();
//   BLEService *service = server->createService(SERVICE_UUID);

