kaleaakash96/SmartCar_esp32/src/main.cpp
//   pCharacteristic = service->createCharacteristic(
//                       CHARACTERISTIC_UUID,
//                       BLECharacteristic::PROPERTY_WRITE
//                     );

//   pCharacteristic->setCallbacks(new MyCallbacks());

//   service->start();
//   BLEDevice::startAdvertising();

//   Serial.println("BLE Ready");
// }

// // ---------------- TASK ----------------
// void TaskCar(void *pvParameters)
// {
//   while (true)
//   {
//     if(Mstatus){
//       car_motion();
//       trunck();
//       vTaskDelay(50 / portTICK_PERIOD_MS);
//     }
//   }
// }

// // ---------------- SETUP ----------------
// void setup()
// {
//   Serial.begin(115200);

//   pinMode(enb1,OUTPUT);
//   pinMode(enb2,OUTPUT);

//   pinMode(M1,OUTPUT);
//   pinMode(M2,OUTPUT);
//   pinMode(M3,OUTPUT);
//   pinMode(M4,OUTPUT);

//   pinMode(sensorLIP,INPUT);
//   pinMode(sensorRIP,INPUT);

//   myservo.attach(servoPin);

//   if (!vl.begin()) {
//     Serial.println("VL6180X fail");
//     while (1);
//   }

//   myservo.write(0);

//   // TFT
//   tft.begin();
//   tft.setRotation(1);
//   tft.fillScreen(TFT_BLACK);

//   gif.begin(BIG_ENDIAN_PIXELS);

//   // BLE START
//   initBLE();

//   // RTOS TASK
//   xTaskCreatePinnedToCore(
//     TaskCar,
//     "CarTask",
//     2048,
//     NULL,
//     2,
//     NULL,
//     0
//   );
// }

// // ---------------- LOOP (DISPLAY) ----------------
// void loop()
// {
//   for (int i = 0; i < gifCount; i++)
//   {
//     gifPlayer(gifs[i].data, gifs[i].size);
//   }
//   // gifPlayer(gifs[0].data, gifs[0].size);
  
// }


///////////////////////////////////////////


#include <ESP32Servo.h>
#include <Wire.h>
#include "Adafruit_VL6180X.h"

#include <AnimatedGIF.h>
#include <SPI.h>
#include <TFT_eSPI.h>

#include "sideview.h"
#include "sleep.h"

// ---------------- BLE ----------------
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>

// ---------------- PINS ----------------
#define M1  26    
#define M2  27
#define M3  14
#define M4  12

#define enb1  25
#define enb2  33

#define sensorLIP 35
#define sensorRIP 32

int cnt = 0;
bool CMDStatus = false;
bool light = false;

// ---------------- OBJECTS ----------------
TFT_eSPI tft = TFT_eSPI();
AnimatedGIF gif;
Adafruit_VL6180X vl = Adafruit_VL6180X();
Servo myservo;

// ---------------- STATE ----------------
enum State { IDLE, RUNNING };
volatile State state = IDLE;

// ---------------- LIGHT ----------------
uint8_t threshold = 10;
bool sleepyPlayed = false;
bool sidePlayed = false;

// ---------------- GIF ----------------
struct GifItem {
  const uint8_t* data;
  size_t size;
};

GifItem gifs[] = {
  {sideview, sizeof(sideview)},
  {sleepy, sizeof(sleepy)}
};

uint16_t usTemp[1][256];

// ---------------- MOTOR ----------------
void motorsOff(){
  digitalWrite(enb1, LOW);
  digitalWrite(enb2, LOW);
}

void motorsOn(){
  digitalWrite(enb1, HIGH);
  digitalWrite(enb2, HIGH);
}

void forward(){
  digitalWrite(M1,HIGH);
  digitalWrite(M2,LOW);
  digitalWrite(M3,HIGH);
  digitalWrite(M4,LOW);
}

void left(){
  digitalWrite(M1,LOW);
  digitalWrite(M2,HIGH);
  digitalWrite(M3,HIGH);
  digitalWrite(M4,LOW); 
}

void right(){
  digitalWrite(M1,HIGH);
  digitalWrite(M2,LOW);
  digitalWrite(M3,LOW);
  digitalWrite(M4,HIGH); 
}

void backward(){
  digitalWrite(M1,LOW);
  digitalWrite(M2,LOW);
  digitalWrite(M3,LOW);
  digitalWrite(M4,LOW); 
}

void trunck()
{
  static bool open = false;
  static unsigned long startTime = 0;

  uint8_t range = vl.readRange();
  uint8_t ref = 100 ;

  if ((range > ref/2) && (range <= ref) && !open) {
    myservo.write(100);
    startTime = millis();
    open = true;
  }

  if (open && (millis() - startTime > 5000)) {
    myservo.write(0);
    open = false;
  }
}


// ---------------- BLE ----------------
#define SERVICE_UUID        "12345678-1234-1234-1234-123456789abc"
#define CHARACTERISTIC_UUID "abcd1234-5678-1234-5678-abcdef123456"

class MyCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pCharacteristic) {
    String cmd = String(pCharacteristic->getValue().c_str());

    Serial.println("BLE: " + cmd);

    cnt++;
    if (cmd == "P" && CMDStatus == false) {
      state = RUNNING;
      motorsOn();
      // if(cnt <= 1){
        CMDStatus = true;
        forward();
        delay(100);
        backward();
      //   cnt = 0;
      // }
    }

    if (cmd == "S") {
      CMDStatus = false;
      state = IDLE;
      motorsOff();
    }
    if (cmd == "K") {
      light = false;
    }
    
  }
};

void initBLE()
{
  BLEDevice::init("ESP32-Robot");

  BLEServer *server = BLEDevice::createServer();
  BLEService *service = server->createService(SERVICE_UUID);

  BLECharacteristic *characteristic =
    service->createCharacteristic(
      CHARACTERISTIC_UUID,
      BLECharacteristic::PROPERTY_WRITE
    );

  characteristic->setCallbacks(new MyCallbacks());

  service->start();
  BLEDevice::startAdvertising();
}

// ---------------- GIF ----------------
void GIFDraw(GIFDRAW *pDraw)
{
  uint8_t *s = pDraw->pPixels;
  uint16_t *d = usTemp[0];
  uint16_t *palette = pDraw->pPalette;

  for (int i = 0; i < pDraw->iWidth; i++)
    d[i] = palette[*s++];

  tft.setAddrWindow(pDraw->iX, pDraw->iY + pDraw->y, pDraw->iWidth, 1);
  tft.pushPixels(d, pDraw->iWidth);
}

void gifPlayer(const uint8_t* data, size_t size)
{
  if (gif.open((uint8_t*)data, size, GIFDraw))
  {
    tft.startWrite();

    while (gif.playFrame(false, NULL))
    {
      vTaskDelay(10 / portTICK_PERIOD_MS); // IMPORTANT
    }

    gif.close();
    tft.endWrite();
  }
}


// ---------------- SENSOR LOGIC ----------------
void carLogic()
{
  if (state != RUNNING) return;

  int sensorL = digitalRead(sensorLIP);
  int sensorR = digitalRead(sensorRIP);

  digitalWrite(enb1,HIGH);
  digitalWrite(enb2,HIGH);

  if(sensorL == 0 && sensorR == 0){
    forward();
    // light = false;
  }
  else if(sensorL == 0 && sensorR == 1){
    left();
    // light = false;
  }
  else if(sensorL == 1 && sensorR == 0){
    right();
    // light = false;
  }
  else if(sensorL == 1 && sensorR == 1){
    backward();
    light = true;
  }
  else{
    backward();
  }

  // int L = digitalRead(sensorLIP);
  // int R = digitalRead(sensorRIP);

  // if (L == 0 && R == 0) forward();
  // else forward();
}

// ---------------- LIGHT CHECK ----------------
void lightLogic()
{
  if (state != RUNNING) return;

  uint8_t val = vl.readLux(VL6180X_ALS_GAIN_5);

  Serial.println(val);

  // DARK → sleepy
  if (val < threshold && !sleepyPlayed)
  {
    Serial.println("Sleepy");
    gifPlayer(gifs[1].data, gifs[1].size);
    sleepyPlayed = true;
    sidePlayed = false;
  }

  // BRIGHT → sideview
  if (val >= threshold && !sidePlayed)
  {
    Serial.println("Sideview");
    gifPlayer(gifs[0].data, gifs[0].size);
    sidePlayed = true;
    sleepyPlayed = false;
  }
}

// ---------------- TASK ----------------
void TaskRobot(void *pv)
{
  while (true)
  {
    if(light == true){
     tft.setTextSize(3);
    tft.setTextColor(TFT_BLUE);
    tft.setCursor(10, 80);
    tft.println("STOP");
    motorsOff();
  }else{
    motorsOn();
    lightLogic();
  }
  // lightLogic();
  carLogic();
  trunck();
    vTaskDelay(10 / portTICK_PERIOD_MS);  // watchdog safe
    yield();
  }
}


// ---------------- SETUP ----------------
void setup()
{
  Serial.begin(115200);

  pinMode(enb1, OUTPUT);
  pinMode(enb2, OUTPUT);
  pinMode(M1, OUTPUT);
  pinMode(M2, OUTPUT);
  pinMode(M3, OUTPUT);
  pinMode(M4, OUTPUT);

  pinMode(sensorLIP, INPUT);
  pinMode(sensorRIP, INPUT);

  motorsOff();

  myservo.attach(16);
  vl.begin();

  tft.begin();
  tft.setRotation(1);
  tft.fillScreen(TFT_BLACK);
  gif.begin(BIG_ENDIAN_PIXELS);

     
    tft.setTextSize(3);
    tft.setTextColor(TFT_BLUE);
    tft.setCursor(10, 80);
    tft.println("2.4 inch TFT");

    delay(1000);

  initBLE();

  xTaskCreatePinnedToCore(
    TaskRobot,
    "RobotTask",
    8192,      // IMPORTANT FIX (stack crash fix)
    NULL,
    1,
    NULL,
    0
  );
}

// ---------------- LOOP (ONLY DISPLAY) ----------------
void loop()
{
  // idle safe loop (no blocking RTOS conflict)
}


